<a href="https://colab.research.google.com/github/larigioad/sql-mysql/blob/main/Analise_credito_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **SQL - Primeiras Análises de Dados com SQL**

- Baixe o arquivo credito.sql
- Coloque dentro de uma bucket (Standard, fine-grained)
- Crie uma instância de um Banco de Dados MySQL
- Crie um banco de dados novo
- Importar o arquivo credito.sql

Ao gerar a tabela do SQL, vocês irão começar com Análises sobre os dados. Utilize o conhecimento adquirido em Pandas para identificar suas próprias análises, além das Análises sugeridas Abaixo. 

1) Mostrar o tipo das colunas da tabela credito.

2) Mostrar o total de registros da tabela credito.

3) Mostrar apenas as primeiras 20 linhas tabela credito.

4) Mostrar a quantidade de pessoas por nível de escolaridade.

5) Mostrar a quantidade de pessoas por estado civil.

6) Mostrar a quantidade de pessoas por faixa salarial.

7) Mostrar os tipos de cartão da tabela credito.

8) Mostrar a quantidade de gêneros existentes nessa tabela.

9) Mostrar a quantidade de pessoas por gênero.

10) Verificar a quantidade em porcentagem de pessoas que possuem mestrado, em relação aos outros níveis de escolaridade.

11) Quantos grupos de pessoas com mestrado podemos ter usando escolaridade, estado civil como filtros?

12) Qual o total de pessoas com escolaridade mestrado e estado civil casado?

13) Qual cartão essas pessoas do exercício anterior possuem?

14) Quantos grupos de pessoas com mestrado podemos ter usando escolaridade, estado civil e salário anual como filtros?

15) Mostrar o total de clientes da base.

16) Mostrar quantas pessoas deixaram de responder alguma informação sobre escolaridade, estado civil ou Salario Anual (Considerar o nulo como 'na') e quantas responderam.

17)Quantos clientes não informaram o salario anual?

18) Qual é o cartão das pessoas que não informaram salario anual na base?
 
19) Qual é o menor e o maior limite de crédito das pessoas que não informaram salario anual na base?

20) Qual é a quantidade de pessoas que não declararam nenhuma dessas três informações (escolaridade, estado civil e salário anual) contida nesta base?

21) sobre essas pessoas que possuem cartão e que não declararam essas informações, quanto de limite de crédito tem cada uma?

In [ ]:
# Criando o database 'credito' e fazendo upload do arquivo:

mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sys                |
+--------------------+

mysql> CREATE database credito;
Query OK, 1 row affected (0.07 sec)

mysql> show databases;
+--------------------+
| Database           |
+--------------------+
| credito            |
| information_schema |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
5 rows in set (0.06 sec)

mysql> use credito;
Reading table information for completion of table and column names
You can turn off this feature to get a quicker startup with -A

Database changed

In [ ]:
# 1) Mostrar o tipo das colunas da tabela credito.

mysql> show tables;
+-------------------+
| Tables_in_credito |
+-------------------+
| creditos          |
+-------------------+
1 row in set (0.06 sec)

mysql> describe creditos;
+-------------------------+-------------+------+-----+---------+-------+
| Field                   | Type        | Null | Key | Default | Extra |
+-------------------------+-------------+------+-----+---------+-------+
| id                      | int         | NO   | PRI | NULL    |       |
| padrao                  | int         | NO   |     | NULL    |       |
| idade                   | int         | NO   |     | NULL    |       |
| sexo                    | varchar(1)  | NO   |     | NULL    |       |
| dependentes             | int         | NO   |     | NULL    |       |
| escolaridade            | varchar(19) | NO   |     | NULL    |       |
| estado_civil            | varchar(10) | NO   |     | NULL    |       |
| salario_anual           | varchar(14) | NO   |     | NULL    |       |
| tipo_cartao             | varchar(8)  | NO   |     | NULL    |       |
| meses_de_relacionamento | int         | NO   |     | NULL    |       |
| qtd_produtos            | int         | NO   |     | NULL    |       |
| iteracoes_12m           | int         | NO   |     | NULL    |       |
| meses_inativo_12m       | int         | NO   |     | NULL    |       |
| limite_credito          | varchar(9)  | NO   |     | NULL    |       |
| valor_transacoes_12m    | varchar(9)  | NO   |     | NULL    |       |
| qtd_transacoes_12m      | int         | NO   |     | NULL    |       |
+-------------------------+-------------+------+-----+---------+-------+

In [ ]:
# 2) Mostrar o total de registros da tabela credito.

mysql> SELECT COUNT(*) FROM creditos;
+----------+
| COUNT(*) |
+----------+
|    10127 |
+----------+

In [ ]:
# 3) Mostrar apenas as primeiras 20 linhas tabela credito.

mysql> SELECT * FROM creditos LIMIT 20;                                                                                                                                                             
+-----------+--------+-------+------+-------------+---------------------+--------------+----------------+-------------+-------------------------+--------------+---------------+-------------------+----------------+----------------------+--------------------+
| id        | padrao | idade | sexo | dependentes | escolaridade        | estado_civil | salario_anual  | tipo_cartao | meses_de_relacionamento | qtd_produtos | iteracoes_12m | meses_inativo_12m | limite_credito | valor_transacoes_12m | qtd_transacoes_12m |
+-----------+--------+-------+------+-------------+---------------------+--------------+----------------+-------------+-------------------------+--------------+---------------+-------------------+----------------+----------------------+--------------------+
| 708082083 |      0 |    45 | F    |           3 | ensino medio        | casado       | menos que $40K | blue        |                      36 |            4 |             3 |                 3 | 3.544,02       | 15.149,31            |                111 |
| 708083283 |      1 |    58 | M    |           0 | na                  | solteiro     | $40K - $60K    | blue        |                      45 |            3 |             3 |                 1 | 3.421,03       | 992,47               |                 21 |
| 708084558 |      1 |    46 | M    |           3 | doutorado           | divorciado   | $80K - $120K   | blue        |                      38 |            6 |             3 |                 3 | 8.258,61       | 1.447,53             |                 23 |
| 708085458 |      0 |    34 | F    |           2 | sem educacao formal | solteiro     | menos que $40K | blue        |                      24 |            6 |             2 |                 2 | 1.438,55       | 3.940,59             |                 82 |
| 708086958 |      0 |    49 | F    |           2 | sem educacao formal | casado       | na             | blue        |                      41 |            3 |             2 |                 5 | 3.128,46       | 4.369,86             |                 59 |
| 708095133 |      0 |    43 | M    |           4 | na                  | na           | $120K +        | blue        |                      34 |            5 |             2 |                 2 | 33.304,71      | 1.448,54             |                 29 |
| 708098133 |      0 |    32 | F    |           0 | mestrado            | casado       | menos que $40K | blue        |                      19 |            6 |             0 |                 1 | 2.834,54       | 1.598,37             |                 39 |
| 708099183 |      0 |    37 | F    |           2 | ensino medio        | solteiro     | menos que $40K | blue        |                      36 |            4 |             2 |                 2 | 5.723,85       | 2.732,91             |                 63 |
| 708100533 |      0 |    55 | F    |           3 | graduacao           | solteiro     | menos que $40K | blue        |                      36 |            3 |             3 |                 3 | 2.679,04       | 4.943,89             |                 85 |
| 708103608 |      0 |    52 | M    |           1 | ensino medio        | solteiro     | $60K - $80K    | blue        |                      45 |            1 |             1 |                 5 | 11.898,27      | 15.798,92            |                128 |
| 708104658 |      0 |    46 | M    |           1 | mestrado            | na           | $40K - $60K    | blue        |                      36 |            4 |             2 |                 3 | 1.438,27       | 2.928,52             |                 48 |
| 708108333 |      1 |    47 | F    |           3 | mestrado            | casado       | na             | blue        |                      36 |            3 |             1 |                 3 | 5.590,55       | 1.507,81             |                 32 |
| 708112008 |      0 |    56 | M    |           2 | mestrado            | casado       | $80K - $120K   | blue        |                      36 |            4 |             3 |                 2 | 23.510,11      | 1.661,27             |                 35 |
| 708113208 |      0 |    53 | F    |           1 | ensino medio        | casado       | menos que $40K | blue        |                      36 |            3 |             2 |                 2 | 1.688,98       | 4.375,24             |                 69 |
| 708117933 |      1 |    44 | F    |           2 | mestrado            | divorciado   | menos que $40K | blue        |                      36 |            3 |             3 |                 2 | 1.880,06       | 2.469,56             |                 34 |
| 708119658 |      0 |    49 | F    |           4 | mestrado            | casado       | $40K - $60K    | blue        |                      38 |            4 |             1 |                 2 | 12.836,35      | 2.519,14             |                 53 |
| 708121908 |      1 |    48 | M    |           4 | na                  | casado       | $80K - $120K   | blue        |                      36 |            2 |             2 |                 3 | 22.917,99      | 2.045,56             |                 45 |
| 708123033 |      0 |    41 | F    |           3 | mestrado            | solteiro     | menos que $40K | silver      |                      30 |            2 |             1 |                 1 | 11.463,91      | 14.511,78            |                105 |
| 708125733 |      0 |    46 | F    |           2 | graduacao           | divorciado   | menos que $40K | blue        |                      36 |            4 |             1 |                 3 | 1.438,36       | 4.311,17             |                 77 |
| 708128733 |      0 |    50 | F    |           3 | doutorado           | solteiro     | na             | blue        |                      36 |            5 |             3 |                 4 | 1.814,86       | 5.014,72             |                 99 |
+-----------+--------+-------+------+-------------+---------------------+--------------+----------------+-------------+-------------------------+--------------+---------------+-------------------+----------------+----------------------+--------------------+
20 rows in set (0.07 sec)

In [ ]:
# 4) Mostrar a quantidade de pessoas por nível de escolaridade.

mysql> SELECT escolaridade, COUNT(*) FROM creditos GROUP BY escolaridade;
+---------------------+----------+
| escolaridade        | COUNT(*) |
+---------------------+----------+
| ensino medio        |     2013 |
| na                  |     1519 |
| doutorado           |      967 |
| sem educacao formal |     1487 |
| mestrado            |     3128 |
| graduacao           |     1013 |
+---------------------+----------+
6 rows in set (0.08 sec)

In [ ]:
# 5) Mostrar a quantidade de pessoas por estado civil.

mysql> SELECT estado_civil, COUNT(*) FROM creditos GROUP BY estado_civil;
+--------------+----------+
| estado_civil | COUNT(*) |
+--------------+----------+
| casado       |     4687 |
| solteiro     |     3943 |
| divorciado   |      748 |
| na           |      749 |
+--------------+----------+
4 rows in set (0.07 sec)

In [ ]:
# 6) Mostrar a quantidade de pessoas por faixa salarial.

mysql> SELECT salario_anual, COUNT(*) FROM creditos GROUP BY salario_anual;
+----------------+----------+
| salario_anual  | COUNT(*) |
+----------------+----------+
| menos que $40K |     3561 |
| $40K - $60K    |     1790 |
| $80K - $120K   |     1535 |
| na             |     1112 |
| $120K +        |      727 |
| $60K - $80K    |     1402 |
+----------------+----------+
6 rows in set (0.07 sec)

In [ ]:
# 7) Mostrar os tipos de cartão da tabela credito.

mysql> SELECT DISTINCT tipo_cartao FROM creditos;
+-------------+
| tipo_cartao |
+-------------+
| blue        |
| silver      |
| gold        |
| platinum    |
+-------------+
4 rows in set (0.07 sec)

In [ ]:
# 8) Mostrar a quantidade de gêneros existentes nessa tabela.

mysql> SELECT COUNT(DISTINCT sexo) FROM creditos;
+-----------------------+
| COUNT( DISTINCT sexo) |
+-----------------------+
|                     2 |
+-----------------------+
1 row in set (0.07 sec)

mysql> SELECT DISTINCT sexo FROM creditos;
+------+
| sexo |
+------+
| F    |
| M    |
+------+
2 rows in set (0.07 sec)

In [ ]:
# 9) Mostrar a quantidade de pessoas por gênero.

mysql> SELECT sexo, COUNT(*) FROM creditos GROUP BY sexo;
+------+----------+
| sexo | COUNT(*) |
+------+----------+
| F    |     5358 |
| M    |     4769 |
+------+----------+
2 rows in set (0.07 sec)

In [ ]:
# 10) Verificar a quantidade em porcentagem de pessoas que possuem mestrado, em relação aos outros níveis de escolaridade.

#numero de pessoas que possuem mestrado
mysql> SELECT COUNT(*) FROM creditos WHERE escolaridade = 'mestrado';
+----------+
| COUNT(*) |
+----------+
|     3128 |
+----------+
1 row in set (0.07 sec)

#porcentagem de pessoas que possuem mestrado
mysql> SELECT COUNT(*) * 100.0 / (SELECT COUNT(*) FROM creditos) AS porcentagem_mestrado
    -> FROM creditos
    -> WHERE escolaridade = 'mestrado';
+----------------------+
| porcentagem_mestrado |
+----------------------+
|             30.88773 |
+----------------------+
1 row in set (0.07 sec)

In [ ]:
# 11) Quantos grupos de pessoas com mestrado podemos ter usando escolaridade, estado civil como filtros?

mysql> SELECT escolaridade, estado_civil, COUNT(*) FROM creditos WHERE escolaridade = 'mestrado' GROUP BY estado_civil;
+--------------+--------------+----------+
| escolaridade | estado_civil | COUNT(*) |
+--------------+--------------+----------+
| mestrado     | casado       |     1479 |
| mestrado     | na           |      227 |
| mestrado     | divorciado   |      225 |
| mestrado     | solteiro     |     1197 |
+--------------+--------------+----------+

In [ ]:
# 12) Qual o total de pessoas com escolaridade mestrado e estado civil casado?

mysql> SELECT escolaridade, estado_civil, COUNT(*) FROM creditos WHERE escolaridade = 'mestrado' AND estado_civil = 'casado';
+--------------+--------------+----------+
| escolaridade | estado_civil | COUNT(*) |
+--------------+--------------+----------+
| mestrado     | casado       |     1479 |
+--------------+--------------+----------+
1 row in set (0.07 sec)

In [ ]:
# 13) Qual cartão essas pessoas do exercício anterior possuem?

mysql> SELECT escolaridade, estado_civil, tipo_cartao, COUNT(*) FROM creditos WHERE escolaridade = 'mestrado' AND estado_civil = 'casado' GROUP BY tipo_cartao;
+--------------+--------------+-------------+----------+
| escolaridade | estado_civil | tipo_cartao | COUNT(*) |
+--------------+--------------+-------------+----------+
| mestrado     | casado       | blue        |     1391 |
| mestrado     | casado       | silver      |       75 |
| mestrado     | casado       | gold        |       12 |
| mestrado     | casado       | platinum    |        1 |
+--------------+--------------+-------------+----------+
4 rows in set (0.07 sec)

In [ ]:
# 14) Quantos grupos de pessoas com mestrado podemos ter usando escolaridade, estado civil e salário anual como filtros?

mysql> SELECT escolaridade, estado_civil, salario_anual, COUNT(*) FROM creditos WHERE escolaridade = 'mestrado' GROUP BY estado_civil, salario_anual;
+--------------+--------------+----------------+----------+
| escolaridade | estado_civil | salario_anual  | COUNT(*) |
+--------------+--------------+----------------+----------+
| mestrado     | casado       | menos que $40K |      528 |
| mestrado     | na           | $40K - $60K    |       44 |
| mestrado     | casado       | na             |      153 |
| mestrado     | casado       | $80K - $120K   |      239 |
| mestrado     | divorciado   | menos que $40K |       77 |
| mestrado     | casado       | $40K - $60K    |      251 |
| mestrado     | solteiro     | menos que $40K |      447 |
| mestrado     | na           | $60K - $80K    |       35 |
| mestrado     | divorciado   | na             |       29 |
| mestrado     | solteiro     | $40K - $60K    |      217 |
| mestrado     | casado       | $60K - $80K    |      205 |
| mestrado     | solteiro     | $60K - $80K    |      147 |
| mestrado     | solteiro     | $80K - $120K   |      174 |
| mestrado     | divorciado   | $120K +        |       11 |
| mestrado     | solteiro     | na             |      128 |
| mestrado     | casado       | $120K +        |      103 |
| mestrado     | na           | menos que $40K |       87 |
| mestrado     | na           | na             |       22 |
| mestrado     | divorciado   | $40K - $60K    |       41 |
| mestrado     | solteiro     | $120K +        |       84 |
| mestrado     | divorciado   | $80K - $120K   |       32 |
| mestrado     | divorciado   | $60K - $80K    |       35 |
| mestrado     | na           | $80K - $120K   |       33 |
| mestrado     | na           | $120K +        |        6 |
+--------------+--------------+----------------+----------+
24 rows in set (0.07 sec)

In [ ]:
# 15) Mostrar o total de clientes da base.

mysql> SELECT COUNT(DISTINCT id) FROM creditos;
+--------------------+
| COUNT(DISTINCT id) |
+--------------------+
|              10127 |
+--------------------+
1 row in set (0.06 sec)

In [ ]:
# 16) Mostrar quantas pessoas deixaram de responder alguma informação sobre escolaridade, estado civil ou Salario Anual (Considerar o nulo como 'na') e quantas responderam.

#Escolaridade
# quantas pessoas deixaram de responder:
mysql> SELECT COUNT(escolaridade) FROM creditos WHERE escolaridade = 'na';
+---------------------+
| COUNT(escolaridade) |
+---------------------+
|                1519 |
+---------------------+
1 row in set (0.07 sec)
# quantas pessoas responderam:
mysql> SELECT COUNT(escolaridade) FROM creditos WHERE NOT  escolaridade = 'na';
+---------------------+
| COUNT(escolaridade) |
+---------------------+
|                8608 |
+---------------------+
1 row in set (0.06 sec)



#Estado civil
#quantas pessoas deixaram de responder:
mysql> SELECT COUNT(estado_civil) FROM creditos WHERE estado_civil = 'na';
+---------------------+
| COUNT(estado_civil) |
+---------------------+
|                 749 |
+---------------------+
1 row in set (0.07 sec)
#quantas pessoas responderam:
mysql> SELECT COUNT(estado_civil) FROM creditos WHERE NOT  estado_civil = 'na';
+---------------------+
| COUNT(estado_civil) |
+---------------------+
|                9378 |
+---------------------+
1 row in set (0.06 sec)



#Salario anual
#quantas pessoas deixaram de responder:
mysql> SELECT COUNT(salario_anual) FROM creditos WHERE salario_anual = 'na';
+----------------------+
| COUNT(salario_anual) |
+----------------------+
|                 1112 |
+----------------------+
1 row in set (0.07 sec)
#quantas pessoas responderam:
mysql> SELECT COUNT(salario_anual) FROM creditos WHERE NOT salario_anual = 'na';
+----------------------+
| COUNT(salario_anual) |
+----------------------+
|                 9015 |
+----------------------+
1 row in set (0.06 sec)

In [ ]:
# 17)Quantos clientes não informaram o salario anual?

mysql> SELECT COUNT(salario_anual) FROM creditos WHERE salario_anual = 'na';
+----------------------+
| COUNT(salario_anual) |
+----------------------+
|                 1112 |
+----------------------+
1 row in set (0.07 sec)

In [ ]:
# 18) Qual é o cartão das pessoas que não informaram salario anual na base?

mysql> SELECT salario_anual, tipo_cartao, COUNT(*) FROM creditos WHERE salario_anual = 'na' GROUP BY tipo_cartao;
+---------------+-------------+----------+
| salario_anual | tipo_cartao | COUNT(*) |
+---------------+-------------+----------+
| na            | blue        |     1045 |
| na            | silver      |       53 |
| na            | gold        |        9 |
| na            | platinum    |        5 |
+---------------+-------------+----------+
4 rows in set (0.07 sec)

In [ ]:
# 19) Qual é o menor e o maior limite de crédito das pessoas que não informaram salario anual na base?

mysql> SELECT MIN(limite_credito) AS menor_limite, MAX(limite_credito) AS menor_limite FROM creditos WHERE salario_anual = 'na';
+--------------+--------------+
| menor_limite | menor_limite |
+--------------+--------------+
| 1.438,05     | 9.989,82     |
+--------------+--------------+
1 row in set (0.06 sec)

In [ ]:
# 20) Qual é a quantidade de pessoas que não declararam nenhuma dessas três informações (escolaridade, estado civil e salário anual) contida nesta base?

mysql> SELECT COUNT(id) FROM creditos WHERE escolaridade = 'na' AND estado_civil = 'na' AND salario_anual = 'na';
+-----------+
| COUNT(id) |
+-----------+
|         7 |
+-----------+
1 row in set (0.06 sec)

In [ ]:
# 21) Sobre essas pessoas que possuem cartão e que não declararam essas informações, quanto de limite de crédito tem cada uma?

mysql> SELECT id,limite_credito FROM creditos WHERE escolaridade = 'na' AND estado_civil = 'na' AND salario_anual = 'na';
+-----------+----------------+
| id        | limite_credito |
+-----------+----------------+
| 709375158 | 7.270,56       |
| 712019883 | 12.778,47      |
| 714127383 | 4.431,84       |
| 715007583 | 1.801,66       |
| 719329983 | 15.648,25      |
| 755959683 | 3.410,15       |
| 769701258 | 12.463,36      |
+-----------+----------------+
7 rows in set (0.07 sec)